Catalogs/КадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КадровыйРезерв</Name>
			<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйСтажМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйСтажМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПланаОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерностьПродолжительностиПланаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальныйУровень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УровниКомпетенцийПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторСпециальностейПоОбразованию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторСпециальностейПоОбразованию</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КадровыйРезерв/Forms/ФормаПодбораКандидатовПоТребованиям/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПозицияРезерва") Тогда
		ПозицияРезерва = Параметры.ПозицияРезерва;
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере(Параметры);
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда
		Элементы.ПодходящиеКандидатыВКадровыйРезерв.РежимВыбора = Истина;
		РежимВыбора = Истина;
	Иначе
		КадровыйРезервФормы.СоздатьКомандыФормыКадровогоРезерва(ЭтотОбъект);
		КадровыйРезервФормы.СоздатьЭлементыФормыКомандыКадровогоРезерва(ЭтотОбъект, Элементы.ГруппаКомандКадровогоРезерва);
		// Команда исключения из резерва тут не вполне уместна - скрываем.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаИсключениеИзКадровогоРезерва", "Видимость", Ложь);
	КонецЕсли;
	
	УстановитьДоступностьРеквизитовФормы(ЭтотОбъект);
	УстановитьКнопкуПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОграничиватьМинимальныйВозрастПриИзменении(Элемент)
	УстановитьДоступностьМинимальногоВозраста(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМаксимальныйВозрастПриИзменении(Элемент)
	УстановитьДоступностьМаксимальногоВозраста(ЭтотОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьОбразованиеПриИзменении(Элемент)
	УстановитьДоступностьОбразования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМинимальныйСтажПриИзменении(Элемент)
	УстановитьДоступностьМинимальногоСтажа(ЭтотОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьМаксимальныйСтажПриИзменении(Элемент)
	УстановитьДоступностьМаксимальногоСтажа(ЭтотОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ВидСтажаПриИзменении(Элемент)
	
	УстановитьФлагиОграничителиСтажа(ЭтотОбъект);
	УстановитьДоступностьОграничителейСтажа(ЭтотОбъект);
	УстановитьДоступностьМинимальногоСтажа(ЭтотОбъект);
	УстановитьДоступностьМаксимальногоСтажа(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодходящиеКандидатыВКадровыйРезерв

&НаКлиенте
Процедура ПодходящиеКандидатыВКадровыйРезервВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УчастникКадровогоРезерва =
		ПодходящиеКандидатыВКадровыйРезерв.НайтиПоИдентификатору(ВыбраннаяСтрока).УчастникКадровогоРезерва;
		
	Если РежимВыбора Тогда
		Закрыть(УчастникКадровогоРезерва);
	Иначе
		КадровыйРезервКлиент.ОткрытьФормуУчастникаКадровогоРезерва(ЭтотОбъект, "ПодходящиеКандидатыВКадровыйРезерв");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодходящиеКандидатыВКадровыйРезервВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(ПодходящиеКандидатыВКадровыйРезерв[Значение].УчастникКадровогоРезерва);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНайти(Команда)
	ЗагрузитьСотрудниковПоОтборам(ОтборыДляЗапроса());
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаявкаНаВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПозицияРезерва", ПозицияРезерва);
	ТекущиеДанные = Элементы.ПодходящиеКандидатыВКадровыйРезерв.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("УчастникКадровогоРезерва", ТекущиеДанные.УчастникКадровогоРезерва);
	КонецЕсли;
	
	КадровыйРезервКлиент.ОткрытьФормуЗаявкаНаВключениеВКадровыйРезерв(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПозицияРезерва", ПозицияРезерва);
	ТекущиеДанные = Элементы.ПодходящиеКандидатыВКадровыйРезерв.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("УчастникКадровогоРезерва", ТекущиеДанные.УчастникКадровогоРезерва);
	КонецЕсли;
	КадровыйРезервКлиент.ОткрытьФормуВключениеВКадровыйРезерв(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИсключениеИзКадровогоРезерва(Команда)
	
	ТекущиеДанные = Элементы.ПодходящиеКандидатыВКадровыйРезерв.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва", ТекущиеДанные.УчастникКадровогоРезерва);
	КадровыйРезервКлиент.ОткрытьФормуИсключениеИзКадровогоРезерва(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(Параметры)

	// Заполняем реквизиты формы по параметрам.
	Если Параметры.Свойство("ЗаполнитьПоПозиции") И Параметры.ЗаполнитьПоПозиции Тогда
		ЗаполнитьФормуПоПозиции(ЭтотОбъект);
	ИначеЕсли Параметры.Свойство("ДанныеТребований") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ДанныеТребований);
	КонецЕсли;	
		
	ЗагрузитьСотрудниковПоОтборам(ОтборыДляЗапроса());

КонецПроцедуры

&НаСервере
Функция ОтборыДляЗапроса()

	Отборы = Новый Массив;
	
	Если ОграничиватьМинимальныйВозраст Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "Возраст", ">=", МинимальныйВозраст);
	КонецЕсли;
	Если ОграничиватьМаксимальныйВозраст Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "Возраст", "<=", МаксимальныйВозраст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОбразования) Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "ВидОбразования", ">=", ВидОбразования);
	КонецЕсли;
	Если ЗначениеЗаполнено(Специальность) Тогда
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "Специальность", "=", Специальность);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСтажа) Тогда
		ИмяОтбораСтажа = КадровыйУчетРасширенный.ИмяОтбораПоКатегорииСтажа(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ВидСтажа, "КатегорияСтажа"));
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "Период", "=", ТекущаяДатаСеанса());
		Если ОграничиватьМинимальныйСтаж И ИмяОтбораСтажа <> Неопределено Тогда
			ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, ИмяОтбораСтажа, ">=",
				МинимальныйСтажЛет * 12 + МинимальныйСтажМесяцев);
		КонецЕсли;
		Если ОграничиватьМаксимальныйСтаж И ИмяОтбораСтажа <> Неопределено Тогда
			ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, ИмяОтбораСтажа, "<=",
				МаксимальныйСтажЛет * 12 + МаксимальныйСтажМесяцев);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отборы;

КонецФункции

&НаСервере
Процедура ЗагрузитьСотрудниковПоОтборам(Отборы)

	КандидатыВРезервисты = КадровыйРезервФормы.НоваяТаблицаКандидатовВРезервисты();
	
	Если Отборы.Количество() = 0 Тогда
		// Загружаем всех.
		
		КритерииПоиска = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК УчастникКадровогоРезерва,
		|	ФизическиеЛица.Представление
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	НЕ ФизическиеЛица.ПометкаУдаления";
		
	Иначе
		// Загружаем по критериям отборов.
		
		КритерииПоиска = КадровыйУчет.КритерииПоискаСотрудниковПоКоллекцииОтборов(Отборы);
		Запрос = КадровыйУчет.ЗапросВТСотрудникиПоКритериямПоиска(КритерииПоиска, Истина, "Справочник.ФизическиеЛица",
			"ВТОтобранныеФизлица");
		
		ТекстЗапросаСУпорядочиванием =
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка КАК УчастникКадровогоРезерва,
			|	ФизическиеЛица.Представление
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтобранныеФизлица КАК ВТОтобранныеФизлица
			|		ПО ФизическиеЛица.Ссылка = ВТОтобранныеФизлица.ФизическоеЛицо";
			
		Запрос.Текст =
			Запрос.Текст
			+ ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов()
			+ ТекстЗапросаСУпорядочиванием;
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса.Выгрузить(), КандидатыВРезервисты);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		МодульПодборПерсонала.ДополнитьТаблицуДляПодбораКандидатовВКадровыйРезерв(КандидатыВРезервисты, КритерииПоиска);
	КонецЕсли;
	
	КандидатыВРезервисты.Сортировать("Представление");
	ПодходящиеКандидатыВКадровыйРезерв.Загрузить(КандидатыВРезервисты);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьФормуПоПозиции(Форма)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыйРезерв.МинимальныйВозраст,
		|	КадровыйРезерв.МаксимальныйВозраст,
		|	КадровыйРезерв.ВидСтажа,
		|	КадровыйРезерв.МинимальныйСтажМесяцев,
		|	КадровыйРезерв.МаксимальныйСтажМесяцев,
		|	КадровыйРезерв.ВидОбразования,
		|	КадровыйРезерв.Специальность
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Форма.ПозицияРезерва);
	ЭтотОбъект = Запрос.Выполнить().Выгрузить()[0];
	
	ЗаполнитьЗначенияСвойств(Форма, ЭтотОбъект);
	
	УстановитьСтаж(Форма, ЭтотОбъект);
	
	УстановитьФлагиОграничителиВозраста(Форма);
	УстановитьФлагиОграничителиОбразования(Форма);
	УстановитьФлагиОграничителиСтажа(Форма)
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовФормы(Форма)

	УстановитьДоступностьМинимальногоВозраста(Форма);
	УстановитьДоступностьМаксимальногоВозраста(Форма);
	УстановитьДоступностьОбразования(Форма);
	УстановитьДоступностьОграничителейСтажа(Форма);
	УстановитьДоступностьМинимальногоСтажа(Форма);
	УстановитьДоступностьМаксимальногоСтажа(Форма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКнопкуПоУмолчанию(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаЗакрыть",
		"КнопкаПоУмолчанию",
		НЕ Форма.РежимВыбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМинимальногоВозраста(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйВозраст",
		"Доступность",
		Форма.ОграничиватьМинимальныйВозраст);
		
	Если Не Форма.ОграничиватьМинимальныйВозраст Тогда
		Форма.МинимальныйВозраст = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМаксимальногоВозраста(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйВозраст",
		"Доступность",
		Форма.ОграничиватьМаксимальныйВозраст);
		
	Если Не Форма.ОграничиватьМаксимальныйВозраст Тогда
		Форма.МаксимальныйВозраст = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОбразования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВидОбразования",
		"Доступность",
		Форма.ОграничиватьОбразование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Специальность",
		"Доступность",
		Форма.ОграничиватьОбразование);
		
	Если НЕ Форма.ОграничиватьОбразование Тогда
		Форма.ВидОбразования = ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
		Форма.Специальность = ПредопределенноеЗначение("Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОграничителейСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ОграничиватьМинимальныйСтаж",
		"Доступность",
		ЗначениеЗаполнено(Форма.ВидСтажа));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ОграничиватьМаксимальныйСтаж",
		"Доступность",
		ЗначениеЗаполнено(Форма.ВидСтажа));
		
	Если Не ЗначениеЗаполнено(Форма.ВидСтажа) Тогда
		Форма.ОграничиватьМинимальныйСтаж = Ложь;
		Форма.ОграничиватьМаксимальныйСтаж = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМинимальногоСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйСтажЛет",
		"Доступность",
		Форма.ОграничиватьМинимальныйСтаж);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МинимальныйСтажМесяцев",
		"Доступность",
		Форма.ОграничиватьМинимальныйСтаж);
		
	Если Не Форма.ОграничиватьМинимальныйСтаж Тогда
		Форма.МинимальныйСтажЛет = 0;
		Форма.МинимальныйСтажМесяцев = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьМаксимальногоСтажа(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйСтажЛет",
		"Доступность",
		Форма.ОграничиватьМаксимальныйСтаж);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МаксимальныйСтажМесяцев",
		"Доступность",
		Форма.ОграничиватьМаксимальныйСтаж);
		
	Если Не Форма.ОграничиватьМаксимальныйСтаж Тогда
		Форма.МаксимальныйСтажЛет = 0;
		Форма.МаксимальныйСтажМесяцев = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтаж(Форма, ЭтотОбъект)

	Если ЗначениеЗаполнено(Форма.ВидСтажа) Тогда
		Форма.МинимальныйСтажЛет = Цел(ЭтотОбъект.МинимальныйСтажМесяцев/12);
		Форма.МинимальныйСтажМесяцев = ЭтотОбъект.МинимальныйСтажМесяцев - Форма.МинимальныйСтажЛет*12;
		Форма.МаксимальныйСтажЛет = Цел(ЭтотОбъект.МаксимальныйСтажМесяцев/12);
		Форма.МаксимальныйСтажМесяцев = ЭтотОбъект.МаксимальныйСтажМесяцев - Форма.МаксимальныйСтажЛет*12;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиВозраста(Форма)

	Форма.ОграничиватьМинимальныйВозраст = ЗначениеЗаполнено(Форма.МинимальныйВозраст);
	Форма.ОграничиватьМаксимальныйВозраст = ЗначениеЗаполнено(Форма.МаксимальныйВозраст);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиОбразования(Форма)

	Форма.ОграничиватьОбразование = ЗначениеЗаполнено(Форма.ВидОбразования) ИЛИ ЗначениеЗаполнено(Форма.Специальность);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагиОграничителиСтажа(Форма)

	Форма.ОграничиватьМинимальныйСтаж = ЗначениеЗаполнено(Форма.ВидСтажа) И (ЗначениеЗаполнено(Форма.МинимальныйСтажЛет)
		Или ЗначениеЗаполнено(Форма.МинимальныйСтажМесяцев));
	Форма.ОграничиватьМаксимальныйСтаж = ЗначениеЗаполнено(Форма.ВидСтажа) И (ЗначениеЗаполнено(Форма.МаксимальныйСтажЛет)
		Или ЗначениеЗаполнено(Форма.МаксимальныйСтажМесяцев));

КонецПроцедуры

#КонецОбласти
